In [72]:
import pandas as pd

In [73]:
pessoas = pd.DataFrame({'nome': ['Rafael', 'João', 'Maria','Lucas','Lúcia','Ana'], 
                        'Altura': [175,165,160,180,165,170],
                        'sexo': ['M','M','F','M','F','F']})

In [74]:
salarios = pd.DataFrame({'nome': ['João', 'Maria','Lucas','Lúcia','Ana','Rafael'], 
                        'salário': [1000,1200,15000,11000,12000,7000]})

In [75]:
pessoas.head()

     nome  Altura sexo
0  Rafael     175    M
1    João     165    M
2   Maria     160    F
3   Lucas     180    M
4   Lúcia     165    F

In [76]:
salarios.head()

    nome  salário
0   João     1000
1  Maria     1200
2  Lucas    15000
3  Lúcia    11000
4    Ana    12000

In [77]:
df = pessoas.set_index('nome').join(salarios.set_index('nome'))
df

        Altura sexo  salário
nome
Rafael     175    M     7000
João       165    M     1000
Maria      160    F     1200
Lucas      180    M    15000
Lúcia      165    F    11000
Ana        170    F    12000